hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/modem.c
// @file modem.c
//
// @author Emiliano Augusto Gonzalez ( lu3vea @ gmail . com)
// @date 2026
// @copyright GNU General Public License v3
// @see https://github.com/hiperiondev/esp32idf_APRS
//
// @note
// This is based on other projects:
//     VP-Digi: https://github.com/sq8vps/vp-digi
//     ESP32APRS: https://github.com/nakhonthai/ESP32APRS_Audio
//     LibAPRS: https://github.com/markqvist/LibAPRS
//
//     please contact their authors for more information.
//
// @brief AFSK/FSK modulator and demodulator core implementation: tone
// generation, filtering and correlation demodulation, DCD, bit recovery and the
// parallel demodulator instances shared by every supported modem profile.

#include <math.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>

#include "esp_attr.h"
#include "esp_log.h"

#include "afsk.h"
#include "ax25.h"
#include "esp32idf_radioamateur_modem_config.h"
#include "modem.h"

static const char *TAG = "modem";

// Configuration for PLL-based data carrier detection.
// 1. MAXPULSE - maximum value of the DCD pulse counter. Higher values give more
//    stability once a correct signal is detected, but delay the DCD release.
// 2. THRES - threshold of the DCD pulse counter. When reached, the input signal
//    is assumed valid. Higher values mean more noise immunity but a slower DCD set.
// 3. The MAXPULSE/THRES difference sets the DCD "inertia".
// 4. INC is added when a symbol change happens near PLL counter zero.
// 5. DEC is subtracted when a symbol change happens too far from zero.
// 6. TUNE is the PLL counter tuning coefficient.
//
// [       DCD OFF    *      |    DCD ON   ]
// 0               COUNTER THRES        MAXPULSE
//        <-DEC INC->
#define DCD1200_MAXPULSE 60
#define DCD1200_THRES    20
#define DCD1200_INC      2
#define DCD1200_DEC      1
#define DCD1200_TUNE     0.74f

#define DCD9600_MAXPULSE 60
#define DCD9600_THRES    40
#define DCD9600_INC      1
#define DCD9600_DEC      1
#define DCD9600_TUNE     0.74f

#define DCD300_MAXPULSE 80
#define DCD300_THRES    20
#define DCD300_INC      4
#define DCD300_DEC      1
#define DCD300_TUNE     0.74f

#define N1200 8  // samples per symbol @ fs=9600
#define N9600 8  // samples per symbol @ fs=76800
#define N300  32 // samples per symbol @ fs=9600
#define NMAX  32 // keep equal to the biggest Nx

// Every Nx is a samples-per-symbol count, so the PLL step must be 2^32 / Nx.
//
// Eight samples per symbol is the resolution this timing-recovery design needs.
// The DPLL's sample instant is quantised to one ADC sample and the majority
// vote in decode() spans three of them, so at four samples per symbol the vote
// window would cover 75 % of a symbol and necessarily reach into a transition.
// Measured on the host against the real modulator, with the analogue path and
// both real clocks modelled and no noise at all, four samples per symbol
// produce hard bit errors at the sampling phases where the ADC instants
// coincide with the DAC's update instants (2/8, 4/8 and 6/8 of a symbol), 1.4 %
// to 2.7 % BER at those phases and 0 % between them; since the two clocks
// differ by ~0.05 %, the alignment walks through the bad phases every ~55 ms
// and a 350 ms transmission crosses them repeatedly.
//
// At eight samples per symbol - what N9600 gives once the ADC runs at 76800 Hz,
// and the same figure the 1200 Bd profile has - the same simulation gives ZERO
// bit errors at every sampling phase and with up to 30 us of TX edge jitter.
//
// The vote window and the DPLL tune constants were both swept on the host:
// (win=3, shift=0) is the best of its family, and the tune surface is chaotic
// at four samples per symbol (some settings collapse to 48 % BER), which is
// itself a sign the loop is bistable there. Resolution, not tuning, is what
// this profile needs.
#define PLL1200_STEP ((int32_t)(uint32_t)(((uint64_t)1 << 32) / N1200))
#define PLL9600_STEP ((int32_t)(uint32_t)(((uint64_t)1 << 32) / N9600))
#define PLL300_STEP  ((int32_t)(uint32_t)(((uint64_t)1 << 32) / N300))

// ADC clock calibration.
//
// PLLxxxx_STEP above assumes samples-per-symbol is exactly Nxxx, which holds
// only if the ADC really runs at MODEM_ADC_SAMPLERATE. It does not: the ADC
// clock is a hardware divider with its own rounding error (see the
// MODEM_ADC_SAMPLERATE comment in esp32idf_radioamateur_modem_config.h), and
// left uncorrected the gap is a steady phase error every DPLL in this file has
// to track for every frame instead of being told about it once.
//
// adcRateRatio is real / nominal ADC rate, which is also (real samples per
// symbol) / (nominal samples per symbol) for a transmitter at its nominal baud
// rate - every station on the air. dacRateRatio is real / nominal DAC alarm
// rate. It matters only to a receiver that hears this node's own G3RUH
// transmitter (full duplex, the wire loopback self-test), because that
// transmitter holds every symbol for a whole number of DAC samples and so
// runs at the DAC error; the AFSK transmitter derives its symbol and tone
// timing from the real alarm rate and is exact. Both ratios are fixed board
// properties (both clocks come from the same crystal) and stay 1.0 until
// ModemCalibrateSampleRate() has run.
static float adcRateRatio = 1.0f;
static float dacRateRatio = 1.0f;

// Real samples-per-symbol over nominal samples-per-symbol for the profile
// ModemInit() is building, derived from the two ratios above.
static float rxRateCorrection = 1.0f;

// @brief Apply the calibrated clock ratio to a nominal PLL step.
//
// nominalStep = 2^32 / N assumes exactly N samples per symbol. The real
// count is N * rxRateCorrection, so the real step is the nominal one divided
// by the same factor.
static int32_t calibratedPllStep(int32_t nominalStep) {
    double step = (double)(uint32_t)nominalStep / (double)rxRateCorrection;

    // Guard the extremes: a step of 0 would never overflow the PLL counter, so
    // decode() would never sample a symbol, and a step above 2^32-1 cannot be
    // represented at all. Both would require the correction to be wildly out
    // of range, which ModemCalibrateSampleRate() rejects, but this keeps the
    // arithmetic itself well-defined regardless.
    if (step < 1.0)
        step = 1.0;
    if (step > 4294967295.0)
        step = 4294967295.0;

