hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/modem.c
    return (int32_t)(uint32_t)(step + 0.5);
}

// @brief Accept a measured/nominal clock ratio only if it is plausible.
//
// Both clocks are quartz derived, so a real error is a few tenths of a
// percent at most; anything past 1 % is a bad measurement (ADC not yet
// running, wrong pin, too short a window - see the quantization note in
// modem_init()). Applying a bogus ratio does more harm than none: a
// miscalibration of well under 1 % is enough to multiply the G3RUH frame loss.
static float plausibleRatio(const char *what, float measured, float nominal) {
    if (!(measured > 0.0f) || !(nominal > 0.0f)) {
        ESP_LOGW(TAG, "ModemCalibrateSampleRate: no usable %s measurement (%.1f Hz), keeping the nominal rate", what, (double)measured);
        return 1.0f;
    }

    float ratio = measured / nominal;
    if (ratio < 0.99f || ratio > 1.01f) {
        ESP_LOGW(TAG, "ModemCalibrateSampleRate: %s ratio %.4f (%.1f Hz for %.1f Hz nominal) out of sane range, ignoring", what, (double)ratio,
                 (double)measured, (double)nominal);
        return 1.0f;
    }
    return ratio;
}

void ModemCalibrateSampleRate(float measuredAdcHz, float measuredDacHz) {
    adcRateRatio = plausibleRatio("ADC", measuredAdcHz, (float)MODEM_ADC_SAMPLERATE);
    dacRateRatio = plausibleRatio("DAC", measuredDacHz, (float)afskGetDacSampleRate());

    ESP_LOGI(TAG, "ModemCalibrateSampleRate: ADC %.1f Hz (%+.3f%%), DAC %.1f Hz (%+.3f%%)", (double)measuredAdcHz, (double)((adcRateRatio - 1.0f) * 100.0f),
             (double)measuredDacHz, (double)((dacRateRatio - 1.0f) * 100.0f));

    // Takes effect from the next ModemInit() (i.e. the next afskSetModem()),
    // which is why modem_init() calls this before the first one. Patching an
    // already-running profile in place would race afsk_rx_task the same way
    // ModemInit() itself has to guard against - see the note above
    // afskSetModem() in afsk.c.
}

#define PLL1200_LOCKED_TUNE     0.74f
#define PLL1200_NOT_LOCKED_TUNE 0.50f
// The tune is the fraction of the phase error left in place at each transition,
// so a HIGHER number is a WEAKER pull and a narrower loop. The only thing this
// loop has to track is the DAC/ADC clock offset - about 17 Hz, 0.045 % - and it
// gets ~4800 transitions a second from a scrambled signal to do it in, so a
// narrow loop tracks it with a steady-state error around 1 % of a symbol. What
// a wide loop buys instead is a faster grab onto edge noise, and there is
// little phase margin to give away at 9600 Bd.
//
// Host simulation, sweeping the DAC/ADC phase over 16 offsets x 2 DMA
// alignments x 5 frames: a wide 0.89 loop loses 2.5 % of frames on a clean
// channel and 12.5 % with 12 us of TX edge jitter, against 0.0 % and 8.8 % for
// the 0.97 used here. 0.97 is also better at every preamble length down to
// 20 ms, so the slower acquisition a narrow loop would normally cost does not
// materialise: 20 ms is still 192 symbols at 9600 Bd.
//
// This is a real but secondary effect. The jitter itself is the dominant term
// and is handled in afsk.c; see the dac_write_isr() notes.
#define PLL9600_LOCKED_TUNE     0.97f
#define PLL9600_NOT_LOCKED_TUNE 0.50f
#define PLL300_LOCKED_TUNE      0.74f
#define PLL300_NOT_LOCKED_TUNE  0.50f

#define AMP_TRACKING_ATTACK 0.16f
#define AMP_TRACKING_DECAY  0.00004f

#define PLL_TUNE_BITS 8 // fixed point bits when tuning the PLL

// ------------------------------------------------------------------
// Quarter-wave sine table, 512 points, 8-bit unsigned, midpoint 128.
// Only the first quarter is stored; sinSample() mirrors/inverts it.
// ------------------------------------------------------------------
#define SIN_LEN 512

// DRAM_ATTR: read by sinSample() from the DAC sample ISR. In flash it is an
// XIP fetch inside the ISR, which is jitter on the transmitted edge.
static const DRAM_ATTR uint8_t sin_table[128] = {
    128, 129, 131, 132, 134, 135, 137, 138, 140, 142, 143, 145, 146, 148, 149, 151, 152, 154, 155, 157, 158, 160, 162, 163, 165, 166,
    167, 169, 170, 172, 173, 175, 176, 178, 179, 181, 182, 183, 185, 186, 188, 189, 190, 192, 193, 194, 196, 197, 198, 200, 201, 202,
    203, 205, 206, 207, 208, 210, 211, 212, 213, 214, 215, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231,
    232, 233, 234, 234, 235, 236, 237, 238, 238, 239, 240, 241, 241, 242, 243, 243, 244, 245, 245, 246, 246, 247, 248, 248, 249, 249,
    250, 250, 250, 251, 251, 252, 252, 252, 253, 253, 253, 253, 254, 254, 254, 254, 254, 255, 255, 255, 255, 255, 255, 255,
};

// IRAM_ATTR: called directly from MODEM_BAUDRATE_TIMER_HANDLER(), which runs
// in the DAC GPTimer ISR. "static inline" alone is just a hint - under
// CONFIG_COMPILER_OPTIMIZATION_DEBUG (-Og) GCC often leaves it un-inlined,
// and an un-inlined static function defaults to flash. That is precisely the
// XIP-fetch-in-the-ISR jitter sin_table's DRAM_ATTR comment above warns
// about; the table being in DRAM buys nothing if the code reading it is
// itself a flash round trip.
static inline uint8_t IRAM_ATTR sinSample(uint16_t i) {
    // Full cycle is SIN_LEN samples. Reduce to one cycle first; only after
    // establishing which half of the cycle we are in (for the 255-v
    // inversion) do we fold down into the stored quarter-wave table.
    uint16_t cycle = i % SIN_LEN;
    uint16_t half = cycle % (SIN_LEN / 2);
    uint16_t newI = (half >= (SIN_LEN / 4)) ? (SIN_LEN / 2 - half - 1) : half;
    uint8_t sine = sin_table[newI];
    return (cycle >= (SIN_LEN / 2)) ? (uint8_t)(255 - sine) : sine;
}

// ------------------------------------------------------------------

struct ModemDemodConfig ModemConfig;

// Note on the ModemInit() vs MODEM_DECODE() race.
//
// ModemInit() memsets demodState[] and then reassigns each filter's
// coeffs/taps piecemeal, while MODEM_DECODE() may be reading that same state
// from the RX task on another core.
//
// What serialises this is afskSetModem(), which suspends the RX task
// across the ModemInit() call. Any other caller of ModemInit() must do the
// same. A spinlock would be the wrong tool anyway: portENTER_CRITICAL masks
// interrupts up to level 3 on this core, which starves the DAC sample clock
// and destroys every AX.25 frame in flight - see the ring buffer notes in
// afsk.c.

static uint8_t N;             // samples per symbol
static uint8_t demodCount;    // number of parallel demodulators
static uint8_t currentSymbol; // current symbol for NRZI encoding
static uint8_t scrambledSymbol;

