hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/modem.c
float markFreq;
float spaceFreq;
float baudRate;

static uint32_t markStep;  // Q32 phase increment per DAC sample
static uint32_t spaceStep; // Q32 phase increment per DAC sample
static uint16_t baudRateStep;
static float txRateHz; // real DAC alarm rate every transmit step is built from

// Receive tuning stored by ModemSetRxTuning() and read by ModemInit().
static modem_rx_tuning_t rxTuning = MODEM_RX_TUNING_DEFAULT();
static int16_t coeffHiI[NMAX], coeffLoI[NMAX], coeffHiQ[NMAX], coeffLoQ[NMAX];
// Data Carrier Detect, as a bitmap: bit i is set while demodulator i has its
// PLL locked. Consumers that only need "is the channel busy" test it for
// non-zero, which stays correct whatever the demodulator count is; the loop
// test in main/aprs_service.c reports the bits so an operator can tell which
// of the parallel demodulators locked.
static uint8_t dcd = 0;

// G3RUH scrambler state. TX and RX must have one each.
//
// A single shared register would be enough for a half duplex node, which never
// scrambles and descrambles at the same moment. It is fatal in full duplex -
// the only mode the loopback self test can run in - because the DAC ISR
// advances the register once per transmitted symbol while the RX task advances
// it once per received symbol, from the same variable, and neither side then
// holds the sequence it needs. They are logically two independent shift
// registers, so they are two variables.
static uint32_t txLfsr = 0x1FFFF;
static uint32_t rxLfsr = 0x1FFFF;

// Fixed 8-tap prefilters of the MODEM_RX_EQ_LEGACY demodulator set, fs=9600,
// gain 32768. Both carry an asymmetric last tap and are not linear phase.
//
// bpf1200Tilted: -6.5 dB at 1200 Hz, +3.0 dB at 2200 Hz - the space tone gains
// 9.5 dB on the mark tone. Used on de-emphasized (speaker) audio.
static const int16_t bpf1200Tilted[8] = { 728, -13418, -554, 19493, -554, -13418, 728, 2104 };

// bpf1200Level: +4.2 dB at 1200 Hz, +4.4 dB at 2200 Hz, peak +6.1 dB at
// 1700 Hz, -17 dB at 300 Hz and -22 dB at 3500 Hz - a band-pass with equal
// gain at both tones. Used on flat (discriminator) audio.
static const int16_t bpf1200Level[8] = { -10513, -10854, 9589, 23884, 9589, -10854, -10513, -879 };

// fs=9600, rectangular, fc1=1500, fc2=1900, 0 dB @ 1600/1800 Hz, N=15, gain 65536
static const int16_t bpf300[15] = {
    186, 8887, 8184, -1662, -10171, -8509, 386, 5394, 386, -8509, -10171, -1662, 8184, 8887, 186,
};

// Longest prefilter a demodulator can hold: the runtime-designed ones are
// bounded by MODEM_RX_BPF_TAPS_MAX, bpf300 is 15 taps.
#define BPF_MAX_TAPS MODEM_RX_BPF_TAPS_MAX
_Static_assert(BPF_MAX_TAPS >= 15, "BPF_MAX_TAPS must hold bpf300");

// fs=9600 Hz, raised cosine, fc=300 Hz (BR=600 Bd), beta=0.8, N=14, gain=65536
static const int16_t lpf300[14] = {
    4385, 4515, 4627, 4720, 4793, 4846, 4878, 4878, 4846, 4793, 4720, 4627, 4515, 4385,
};

static const int16_t lpf1200[15] = {
    -6128, -5974, -2503, 4125, 12679, 21152, 27364, 29643, 27364, 21152, 12679, 4125, -2503, -5974, -6128,
};

// fs=76800 Hz, Gaussian, fc ~5000 Hz (-3 dB at 0.53 x baud), N=15, gain=65536.
//
// The width of this filter is chosen for the sample rate it actually runs at.
// With 8 samples per symbol a Gaussian whose impulse response is long relative
// to one symbol costs real intersymbol interference, so sigma cannot simply be
// scaled up with the rate. Host sweep of sigma against worst-case BER over 8
// sampling phases:
//
//      sigma 0.8..2.2  ->  0 errors / 7374 bits
//      sigma 2.4       ->  6
//      sigma 2.6       -> 12
//      sigma 2.8..3.0  -> 18
//
// sigma 2.0 is taken: mid-range, so there is margin on the ISI side, while
// -3 dB at ~5 kHz is a defensible noise bandwidth for 9600 Bd on air rather than
// merely whatever passes a noiseless loopback.
static const int16_t lpf9600[15] = {
    29, 145, 574, 1769, 4245, 7930, 11538, 13076, 11538, 7930, 4245, 1769, 574, 145, 29,
};

#define LPF_MAX_TAPS    15
#define FILTER_MAX_TAPS ((LPF_MAX_TAPS > BPF_MAX_TAPS) ? LPF_MAX_TAPS : BPF_MAX_TAPS)

struct Filter {
    const int16_t *coeffs;
    uint8_t taps;
    int32_t samples[FILTER_MAX_TAPS];
    uint8_t idx; // index of the newest sample in the circular samples[] buffer
    uint8_t gainShift;
};

// Front half of a demodulator: prefilter, mark and space quadrature
// correlators, and a post-detection low-pass on the magnitude of each tone.
//
// Everything here is linear up to the magnitudes, and the post-detection
// low-pass is linear too, so low-pass filtering the two magnitudes separately
// and weighting them afterwards is the same as low-pass filtering the weighted
// difference. That is what lets several slicers (struct DemodState) share one
// correlator: each of them only adds a multiply and a subtract per sample.
//
// G3RUH has no tones. Its correlator is a pass-through: the input sample is
// the "mark" magnitude, "space" stays 0, and markLpf is the 9600 Bd receive
// filter, so its single slicer sees exactly the baseband signal.
struct Correlator {
    enum ModemPrefilter prefilter;
    struct Filter bpf;
    int16_t bpfTable[BPF_MAX_TAPS]; // storage for a prefilter designed by ModemInit()
    float bpfTiltDb;                // prefilter gain at the space tone minus gain at the mark tone
    bool bpfDesigned;               // bpfTable holds a prefilter designed from rxTuning
    int8_t bpfTiltRequestedDb;      // tilt the designed prefilter was asked for

    int16_t samples[NMAX]; // prefiltered input, one symbol long, circular
    uint8_t samplesIdx;

    struct Filter markLpf;
    struct Filter spaceLpf;

    // Tone magnitudes of the current sample, before and after the
    // post-detection low-pass.
    int32_t mark;
    int32_t space;
    int32_t markFiltered;
    int32_t spaceFiltered;

    // Magnitude of the mark tone while it is the stronger one, and of the
    // space tone while that one is: first-order averages with a time constant
    // of 64 samples (eight symbols at 1200 Bd), read by ModemGetTwistDb().
    int32_t markLevel;
    int32_t spaceLevel;
};

// Back half of a demodulator: one slicer on one correlator's output, with its
// own carrier detect, clock recovery and, in ax25.c, its own HDLC decoder.
//
// The slicer compares the mark magnitude against the space magnitude scaled
// by spaceWeight. A weight below unity favours the mark tone and so suits a
// signal whose space tone arrives louder than its mark tone, and the other way
// round; a set of slicers with weights spread over the expected range of tone
// twist covers that range from a single correlator.
struct DemodState {
    uint8_t corr;        // index into correlators[]
    int32_t spaceWeight; // weight of the space magnitude, Q(SLICER_WEIGHT_BITS)
    float spaceWeightDb; // the same weight in dB, for the diagnostics
    uint8_t rawSymbols;  // raw, unsynchronized symbols
    uint8_t syncSymbols; // synchronized symbols

    uint8_t dcd;

    int32_t pll;
    int32_t pllStep;
    int32_t pllLockedTune;
    int32_t pllNotLockedTune;

    int32_t dcdPll;
    uint8_t dcdLastSymbol;
    uint16_t dcdCounter;
    uint16_t dcdMax;
    uint16_t dcdThres;
    uint16_t dcdInc;
    uint16_t dcdDec;
    int32_t dcdTune;
};

// Fixed-point position of DemodState::spaceWeight. With the weights bounded to
// +-SLICE_WEIGHT_DB_MAX (a factor of 7.9) and the magnitudes and their
// low-passed values well inside 2^15, the product stays inside int32.
#define SLICER_WEIGHT_BITS 12

static struct Correlator correlators[MODEM_MAX_CORRELATOR_COUNT];
static struct DemodState demodState[MODEM_MAX_DEMODULATOR_COUNT];
static uint8_t corrCount; // correlators in use, 1..MODEM_MAX_CORRELATOR_COUNT

// Amplitude of the demodulator input, common to every demodulator because
// they all receive the same samples.
static int16_t inputPeak;
static int16_t inputValley;

