hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/modem.c
static void decode(uint8_t symbol, uint8_t demod, uint16_t mV);
static void correlate(int16_t sample, struct Correlator *c);
static int32_t slice(struct DemodState *dem, const struct Correlator *c);

static int32_t filterRun(struct Filter *f, int32_t input) {
    // An unconfigured filter (taps == 0) has no coefficients to run against.
    // Without this guard, f->taps - 1 wraps to 255 and the code below
    // indexes far past the end of samples[].
    if (f->taps == 0)
        return 0;

    // Circular buffer: the newest sample overwrites the oldest one in place
    // instead of shifting every other sample down by one on every call.
    if (f->idx == 0)
        f->idx = f->taps;
    f->idx--;
    f->samples[f->idx] = input;

    int32_t out = 0;
    uint8_t idx = f->idx;
    for (uint8_t i = 0; i < f->taps; i++) {
        out += (int32_t)f->coeffs[i] * f->samples[idx];
        if (++idx == f->taps)
            idx = 0;
    }

    return out >> f->gainShift;
}

float ModemGetBaudrate(void) {
    return baudRate;
}

uint8_t ModemGetDemodulatorCount(void) {
    return demodCount;
}

uint8_t ModemDcdState(void) {
    return dcd;
}

void ModemGetSignalLevel(uint8_t modem, int8_t *peak, int8_t *valley, uint8_t *level) {
    // Public component API: the index is bounded against the demodState array
    // here rather than trusted, so a caller outside the component cannot read
    // past it. An out-of-range demodulator reports a flat, silent channel.
    if (modem >= MODEM_MAX_DEMODULATOR_COUNT) {
        *peak = 0;
        *valley = 0;
        *level = 0;
        return;
    }

    // Every demodulator sees the same input, so the figures are shared.
    *peak = (int8_t)((100 * (int32_t)inputPeak) >> 12);
    *valley = (int8_t)((100 * (int32_t)inputValley) >> 12);
    *level = (uint8_t)((100 * (int32_t)(inputPeak - inputValley)) >> 13);
}

enum ModemPrefilter ModemGetFilterType(uint8_t modem) {
    // Same bound as ModemGetSignalLevel(): an out-of-range demodulator reports
    // PREFILTER_NONE, the value that makes the pre-filter path a no-op.
    if (modem >= MODEM_MAX_DEMODULATOR_COUNT)
        return PREFILTER_NONE;

    return correlators[demodState[modem].corr].prefilter;
}

float ModemGetFilterTiltDb(uint8_t modem) {
    if (modem >= MODEM_MAX_DEMODULATOR_COUNT)
        return 0.0f;

    const struct Correlator *c = &correlators[demodState[modem].corr];
    return (c->prefilter == PREFILTER_NONE) ? 0.0f : c->bpfTiltDb;
}

float ModemGetSlicerWeightDb(uint8_t modem) {
    if (modem >= MODEM_MAX_DEMODULATOR_COUNT || ModemConfig.modem == MODEM_MODEM_G3RUH)
        return 0.0f;

    return demodState[modem].spaceWeightDb;
}

uint8_t ModemGetCorrelatorIndex(uint8_t modem) {
    if (modem >= MODEM_MAX_DEMODULATOR_COUNT)
        return 0;

    return demodState[modem].corr;
}

int8_t ModemGetTwistDb(uint8_t modem) {
    if (modem >= MODEM_MAX_DEMODULATOR_COUNT || ModemConfig.modem == MODEM_MODEM_G3RUH)
        return 0;

    const struct Correlator *c = &correlators[demodState[modem].corr];
    int32_t mark = c->markLevel;
    int32_t space = c->spaceLevel;
    if (mark <= 0 || space <= 0)
        return 0;

    float db = 20.0f * log10f((float)space / (float)mark) - ModemGetFilterTiltDb(modem);
    if (db > 30.0f)
        db = 30.0f;
    else if (db < -30.0f)
        db = -30.0f;
    return (int8_t)lrintf(db);
}

void ModemSetRxTuning(const modem_rx_tuning_t *t) {
    if (t == NULL)
        return;

    rxTuning = *t;
    modem_rx_tuning_sanitize(&rxTuning);
}

static void setDcd(bool state) {
    if (state)
        LED_Status2(0, 255, 0);
    else
        LED_Status2(0, 0, 0);
}

static inline uint8_t descramble(uint8_t in) {
    // G3RUH descrambling (x^17+x^12+1). Self synchronising: the register only
    // has to see 17 symbols of any signal to be in step, so no init handshake
    // is needed and the initial value below does not matter.
    uint8_t bit = (uint8_t)(((rxLfsr & 0x10000) > 0) ^ ((rxLfsr & 0x800) > 0) ^ (in > 0));

    rxLfsr <<= 1;
    rxLfsr |= in;
    return bit;
}

// IRAM_ATTR: called from MODEM_BAUDRATE_TIMER_HANDLER() (DAC GPTimer ISR)
// whenever ModemConfig.modem == MODEM_MODEM_G3RUH. Same -Og inlining risk as
// dac_scale()/sinSample() above - "static inline" is not a guarantee, and an
// un-inlined static function defaults to flash. This one is gated on exactly
// the G3RUH path, which is why it can look like a 9600-only problem while
// 1200 Bd profiles never call it and never show the jitter. descramble()
// does not need this: it only runs from decode(), which executes in
// afsk_rx_task task context, not at interrupt level.
static inline uint8_t IRAM_ATTR scramble(uint8_t in) {
    // G3RUH scrambling (x^17+x^12+1)
    uint8_t bit = (uint8_t)(((txLfsr & 0x10000) > 0) ^ ((txLfsr & 0x800) > 0) ^ (in > 0));

    txLfsr <<= 1;
    txLfsr |= bit;
    return bit;
}

void MODEM_DECODE(int16_t sample, uint16_t mVrms) {
    uint8_t dcdBits = 0;

    // input signal amplitude tracking
    if (sample >= inputPeak)
        inputPeak += (int16_t)(((int32_t)(AMP_TRACKING_ATTACK * 32768.f) * (int32_t)(sample - inputPeak)) >> 15);
    else
        inputPeak += (int16_t)(((int32_t)(AMP_TRACKING_DECAY * 32768.f) * (int32_t)(sample - inputPeak)) >> 15);

    if (sample <= inputValley)
        inputValley -= (int16_t)(((int32_t)(AMP_TRACKING_ATTACK * 32768.f) * (int32_t)(inputValley - sample)) >> 15);
    else
        inputValley -= (int16_t)(((int32_t)(AMP_TRACKING_DECAY * 32768.f) * (int32_t)(inputValley - sample)) >> 15);

    for (uint8_t c = 0; c < corrCount; c++)
        correlate(sample, &correlators[c]);

    for (uint8_t i = 0; i < demodCount; i++) {
        uint8_t symbol = (slice(&demodState[i], &correlators[demodState[i].corr]) > 0);

        decode(symbol, i, mVrms);
        if (demodState[i].dcd)
            dcdBits |= (uint8_t)(1u << i);
    }

    // The status LED and the busy-channel test both mean "any demodulator
    // locked", so they key off the bitmap being non-zero.
    setDcd(dcdBits != 0);
    dcd = dcdBits;
}

// Modulator state. Runs in the GPTimer ISR at the configured DAC sample rate.
//
// Symbol timing differs between the two kinds of profile.
//
// The AFSK profiles advance a Q32 symbol-phase accumulator by
// baud * 2^32 / (real DAC alarm rate) per DAC sample and start a new symbol
// each time it wraps, so the symbol rate is exact whatever the alarm period
// rounds to. A symbol edge lands on the nearest DAC sample - at 1200 Bd that
// is at most 3 % of a symbol, and the tone keeps a continuous phase across
// it, so the receiver never sees it.
//
// G3RUH holds every symbol for exactly baudRateStep DAC samples instead. At
// four samples per symbol a fractional accumulator would move one edge in
// every few hundred by a quarter of a symbol, which is the kind of edge
// jitter this profile cannot absorb. Whole-sample symbols keep every edge on
// the same grid and turn the alarm rounding into a small, uniform rate offset
// the receiving DPLL tracks.
static uint32_t phaseAcc = 0;      // Q32: the full sine cycle is 2^32
static uint32_t baudPhase = 0;     // Q32 symbol phase, AFSK profiles
static uint32_t baudPhaseStep = 0; // Q32 symbol phase increment per DAC sample
static uint16_t sampleIndex = 0;   // DAC samples left in the current symbol, G3RUH
static bool symbolDue = true;      // the next DAC sample starts a new symbol

