hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/modem.c
uint8_t IRAM_ATTR MODEM_BAUDRATE_TIMER_HANDLER(void) {
    uint8_t sinwave = 0;

    if (symbolDue) {
        symbolDue = false;
        if (Ax25GetTxBit() == 0) // next bit is 0 -> change symbol (NRZI)
            currentSymbol ^= 1;

        // Scramble exactly once per symbol, here, and hold the result for the
        // whole symbol below. The receiver's descrambler is clocked once per
        // symbol, so a scrambler clocked on every DAC sample would produce a
        // sequence it could never match. The other profiles are not
        // scrambled.
        if (ModemConfig.modem == MODEM_MODEM_G3RUH)
            scrambledSymbol = scramble(currentSymbol);
    }

    if (ModemConfig.modem == MODEM_MODEM_G3RUH) {
        sinwave = scrambledSymbol ? 240 : 20;

        if (sampleIndex > 1) {
            sampleIndex--;
        } else {
            sampleIndex = baudRateStep;
            symbolDue = true;
        }
    } else {
        // The phase accumulator is 32 bits wide and the table index is the top
        // 9 of them, with the fraction carried in the low 23 bits. Stepping the
        // table index by an integer instead would quantise the tone to the DAC
        // sample rate over SIN_LEN, i.e. 75 Hz at 38400 - more than 1 % off
        // frequency for every profile. Carrying the fraction, with the step
        // built from the real alarm rate, keeps every tone exact.
        //
        // The index is still 9 bit, so the table lookup truncates the phase -
        // that is amplitude distortion around -54 dBc, already well under the
        // 8-bit DAC's own noise floor.
        if (currentSymbol)
            phaseAcc += spaceStep;
        else
            phaseAcc += markStep;

        sinwave = sinSample((uint16_t)((phaseAcc >> 23) & (SIN_LEN - 1)));

        uint32_t previous = baudPhase;
        baudPhase += baudPhaseStep;
        if (baudPhase < previous)
            symbolDue = true;
    }

    return sinwave;
}

// @brief Run one input sample through a correlator.
//
// Updates the tone magnitudes of c, before and after the post-detection
// low-pass. The magnitude of each tone is the true (L2) magnitude of its I/Q
// correlator pair: |I| + |Q| would swing between 1 and 1.41 times it with the
// phase of the tone against the correlator, which is 3 dB of noise on the
// mark/space decision.
//
// @param sample Received sample, no more than 13 bits.
static void correlate(int16_t sample, struct Correlator *c) {
    if (ModemConfig.modem == MODEM_MODEM_G3RUH) {
        c->mark = sample;
        c->markFiltered = filterRun(&c->markLpf, sample);
        return;
    }

    if (c->prefilter != PREFILTER_NONE)
        c->samples[c->samplesIdx] = (int16_t)filterRun(&c->bpf, sample);
    else
        c->samples[c->samplesIdx] = sample;

    // N is a runtime value (N1200 / N300 / N9600), so "% N" cannot be
    // strength-reduced to a mask by the compiler and would otherwise become a
    // real integer division on every tap. Wrap on compare instead.
    if (++c->samplesIdx == N)
        c->samplesIdx = 0;

    int32_t outLoI = 0, outLoQ = 0, outHiI = 0, outHiQ = 0;
    uint8_t idx = c->samplesIdx;

    for (uint8_t i = 0; i < N; i++) {
        int16_t t = c->samples[idx];
        outLoI += t * coeffLoI[i];
        outLoQ += t * coeffLoQ[i];
        outHiI += t * coeffHiI[i];
        outHiQ += t * coeffHiQ[i];

        if (++idx == N)
            idx = 0;
    }

    // The coefficients are Q12 and a symbol holds up to 32 samples, so the
    // sums fit int32 and their squares fit a float; the 2^-14 scale keeps the
    // magnitudes in the same range as the input samples.
    const float scale = 1.0f / 16384.0f;
    int32_t lo = (int32_t)(sqrtf((float)outLoI * (float)outLoI + (float)outLoQ * (float)outLoQ) * scale);
    int32_t hi = (int32_t)(sqrtf((float)outHiI * (float)outHiI + (float)outHiQ * (float)outHiQ) * scale);

    // Tone levels for the twist estimate: each tone is averaged only while
    // it is the stronger one.
    if (lo > hi)
        c->markLevel += (lo - c->markLevel) >> 6;
    else
        c->spaceLevel += (hi - c->spaceLevel) >> 6;

    c->mark = lo;
    c->space = hi;
    c->markFiltered = filterRun(&c->markLpf, lo);
    c->spaceFiltered = filterRun(&c->spaceLpf, hi);
}

// @brief Slice one correlator output and run the demodulator's carrier detect.
// @return Low-passed decision variable: > 0 for mark, <= 0 for space (for
//         G3RUH, the filtered baseband sample).
static int32_t slice(struct DemodState *dem, const struct Correlator *c) {
    int32_t sample = c->mark - ((c->space * dem->spaceWeight) >> SLICER_WEIGHT_BITS);

    // DCD using a "PLL". The PLL runs nominally at the baudrate; its counter
    // counts up and overflows to a minimal negative value, so it crosses zero
    // in the middle. A tone change should happen near this zero crossing.
    // Changes near zero raise the DCD pulse counter and pull the counter phase
    // towards zero; changes far from zero lower it. Above dcdThres we claim the
    // incoming signal is valid. dcdMax keeps the DCD from getting "sticky".
    dem->dcdPll = (int32_t)((uint32_t)(dem->dcdPll) + (uint32_t)(dem->pllStep));

    if ((sample > 0) != dem->dcdLastSymbol) { // tone changed
        if ((uint32_t)abs(dem->dcdPll) < (uint32_t)(dem->pllStep)) {
            dem->dcdCounter += dem->dcdInc;
            if (dem->dcdCounter > dem->dcdMax)
                dem->dcdCounter = dem->dcdMax;
        } else {
            if (dem->dcdCounter >= dem->dcdDec)
                dem->dcdCounter -= dem->dcdDec;
            else
                dem->dcdCounter = 0;
        }

        dem->dcdPll = (int32_t)(((int64_t)dem->dcdPll * (int64_t)dem->dcdTune) >> PLL_TUNE_BITS);
    }

    dem->dcdLastSymbol = (sample > 0);

    dem->dcd = (dem->dcdCounter > dem->dcdThres) ? 1 : 0;

    return c->markFiltered - ((c->spaceFiltered * dem->spaceWeight) >> SLICER_WEIGHT_BITS);
}

// @brief Bit/clock recovery, NRZI decoding, and hand-off to the protocol layer.
static void decode(uint8_t symbol, uint8_t demod, uint16_t mV) {
    struct DemodState *dem = &demodState[demod];

    int32_t previous = dem->pll;

    dem->pll = (int32_t)((uint32_t)(dem->pll) + (uint32_t)(dem->pllStep));

    dem->rawSymbols <<= 1;
    dem->rawSymbols |= (symbol & 1);

    if ((dem->pll < 0) && (previous > 0)) { // PLL overflow: sample the symbol
        dem->syncSymbols <<= 1;

        // take the last three symbols; one is not enough, three work well
        uint8_t sym = dem->rawSymbols & 0x07;
        if (sym == 0x07 || sym == 0x06 || sym == 0x05 || sym == 0x03)
            sym = 1;
        else
            sym = 0;

        if (ModemConfig.modem == MODEM_MODEM_G3RUH)
            sym = descramble(sym);

        dem->syncSymbols |= sym;

        // NRZI decoding: no transition -> 1, transition -> 0
        if (((dem->syncSymbols & 0x03) == 0x03) || ((dem->syncSymbols & 0x03) == 0x00))
            Ax25BitParse(1, demod, mV);
        else
            Ax25BitParse(0, demod, mV);
    }

