hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/modem.c
    if (((dem->rawSymbols & 0x03) == 0x02) || ((dem->rawSymbols & 0x03) == 0x01)) {
        if (!dem->dcd) // PLL not locked - adjust faster
            dem->pll = (int32_t)(((int64_t)dem->pll * (int64_t)dem->pllNotLockedTune) >> PLL_TUNE_BITS);
        else // PLL locked - adjust slower
            dem->pll = (int32_t)(((int64_t)dem->pll * (int64_t)dem->pllLockedTune) >> PLL_TUNE_BITS);
    }
}

void ModemTransmitStart(void) {
    setPtt(true);
    setTransmit(true);
    ESP_LOGD(TAG, "ModemTransmitStart");
}

// @brief Stop TX and go back to RX.
//
// Called from the DAC timer ISR via Ax25GetTxBit(), so it must be ISR safe:
// it only lowers a flag. AFSK_ServiceTx(), running in the service task, does
// the actual teardown (stop the timer, park the DAC, release PTT).
void IRAM_ATTR ModemTransmitStop(void) {
    setTransmit(false);
}

bool ModemTxTeardownPending(void) {
    return AFSK_TxTeardownPending();
}

void ModemGetStepTones(float *mark, float *space) {
    // Derived from the steps themselves, so this reports what the modulator is
    // really doing rather than what it was asked to do.
    if (mark)
        *mark = (float)(((double)markStep * (double)txRateHz) / 4294967296.0);
    if (space)
        *space = (float)(((double)spaceStep * (double)txRateHz) / 4294967296.0);
}

// Prefilter tilt tables of the designed presets, dB (space gain minus mark
// gain), for flat (discriminator) and de-emphasized (speaker) input. See
// modem_rx_eq_preset_t in esp32idf_radioamateur_modem.h.
static const int8_t tiltSingleFlat[1] = { 0 };
static const int8_t tiltSingleSpeaker[1] = { 3 };
static const int8_t tiltDiv2Flat[2] = { 0, -5 };
static const int8_t tiltDiv2Speaker[2] = { 0, 5 };
static const int8_t tiltDiv3Flat[3] = { 4, 0, -5 };
static const int8_t tiltDiv3Speaker[3] = { 0, 3, 6 };

// MODEM_RX_EQ_MULTISLICE: MODEM_RX_SLICE_PREFILTERS prefilters, each feeding
// MODEM_RX_SLICE_WEIGHTS slicers. The tilt tables hold the tilt requested from
// each prefilter; the target tables hold the twist compensation every slicer
// ends up with, in dB: the prefilter's realized tilt plus the slicer's own
// weight on the space magnitude. Positive values boost the space tone against
// the mark tone, negative ones favour the mark tone.
//
// Twist compensation is split between the two on purpose. A slicer is nearly
// free and reaches any weight exactly, where a short prefilter realizes only
// part of a large tilt, so the slicers carry most of the range and each
// slicer weight is derived from the tilt its prefilter actually realized
// (setup1200DemodSet()). That keeps the targets on an even grid whatever the
// prefilter length. What a slicer cannot do is keep a loud tone out of the
// other tone's correlator arm: the correlator is one symbol long, so its
// response is broad enough for a tone 10 dB up to leak into the other arm and
// bury the weaker tone no matter how the two magnitudes are weighted
// afterwards. Only a filter ahead of the correlators removes it, which is why
// the two prefilters are tilted towards the two ends of the range.
//
// The targets cover twist as it reaches the demodulators, which includes the
// slope of the capture chain itself: the decimation filter alone takes about
// 1.3 dB off the space tone, and a sound card or a receiver's audio stage adds
// its own. De-emphasized (speaker) audio arrives with the space tone well
// below the mark tone - a receiver's de-emphasis takes about 5 dB between the
// two tones, and speaker outputs measured with the audio chain in front of the
// ADC reach 15 dB - so its set runs from +16 to -8.5 dB. Flat (discriminator)
// audio carries up to about 12 dB of excess space tone from a pre-emphasizing
// transmitter and the chain's own slope from a flat one, so its set runs from
// +9 to -15.5 dB. Both sets step 3.5 dB, which keeps every twist inside
// about 1.75 dB of a slicer.
#define MODEM_RX_SLICE_PREFILTERS 2
#define MODEM_RX_SLICE_WEIGHTS    (MODEM_RX_SLICER_COUNT / MODEM_RX_SLICE_PREFILTERS)
_Static_assert(MODEM_RX_SLICER_COUNT == MODEM_RX_SLICE_PREFILTERS * MODEM_RX_SLICE_WEIGHTS,
               "MODEM_RX_SLICER_COUNT must be a whole number of slicers per prefilter");
_Static_assert(MODEM_RX_SLICE_PREFILTERS <= MODEM_MAX_CORRELATOR_COUNT, "the multi-slicer preset needs one correlator per prefilter");
_Static_assert(MODEM_RX_SLICE_WEIGHTS == 4, "the multi-slicer target tables hold four slicers per prefilter");

static const int8_t sliceTiltFlat[MODEM_RX_SLICE_PREFILTERS] = { 5, -9 };
static const int8_t sliceTiltSpeaker[MODEM_RX_SLICE_PREFILTERS] = { 9, -4 };
static const float sliceTargetFlat[MODEM_RX_SLICE_PREFILTERS][MODEM_RX_SLICE_WEIGHTS] = {
    { 9.0f, 5.5f, 2.0f, -1.5f },
    { -5.0f, -8.5f, -12.0f, -15.5f },
};
static const float sliceTargetSpeaker[MODEM_RX_SLICE_PREFILTERS][MODEM_RX_SLICE_WEIGHTS] = {
    { 16.0f, 12.5f, 9.0f, 5.5f },
    { 2.0f, -1.5f, -5.0f, -8.5f },
};

// Largest slicer weight, dB either way. The targets sit within this of any
// tilt a designed prefilter can realize, and it keeps the weighted magnitude
// inside int32 (see SLICER_WEIGHT_BITS).
#define SLICE_WEIGHT_DB_MAX 18.0f

// Frequency grid of the prefilter designer, points from 0 Hz to fs/2.
#define BPF_DESIGN_GRID 128

// @brief Gain of an FIR, Q15 coefficients, at one frequency.
static float firGain(const int16_t *c, uint8_t taps, float f, float fs) {
    float re = 0.0f, im = 0.0f;
    for (uint8_t n = 0; n < taps; n++) {
        float w = 2.0f * (float)M_PI * f * (float)n / fs;
        re += (float)c[n] * cosf(w);
        im -= (float)c[n] * sinf(w);
    }
    return sqrtf(re * re + im * im) / 32768.0f;
}

// @brief Design a linear-phase band-pass prefilter with a tilt.
//
// Frequency-sampling design on a grid of BPF_DESIGN_GRID + 1 points with a
// Hamming window. The target gain is zero outside [lo, hi] and, inside it,
// varies linearly in dB: 0 dB at markHz, tiltDb at spaceHz. The result is
// scaled so the passband maximum is at most unity, which keeps the int16 cast
// after filterRun() and the post-detection filter's int32 accumulator within
// range for the +-2047 input demodulate() is fed. Runs only from ModemInit(),
// with the receive task held, so the float work here costs nothing in the
// signal path.
static void designPrefilter(int16_t *out, uint8_t taps, float fs, float lo, float hi, float markHz, float spaceHz, float tiltDb) {
    static float target[BPF_DESIGN_GRID + 1];
    float h[BPF_MAX_TAPS];
    const int m = (taps - 1) / 2;

    // Target gain on the grid, trapezoid-rule weights folded in.
    for (int k = 0; k <= BPF_DESIGN_GRID; k++) {
        float f = (fs * 0.5f) * (float)k / (float)BPF_DESIGN_GRID;
        target[k] = 0.0f;
        if (f >= lo && f <= hi) {
            target[k] = powf(10.0f, (tiltDb * (f - markHz) / (spaceHz - markHz)) / 20.0f);
            if (k == 0 || k == BPF_DESIGN_GRID)
                target[k] *= 0.5f;
        }
    }

    for (int n = 0; n < taps; n++) {
        float acc = 0.0f;
        for (int k = 0; k <= BPF_DESIGN_GRID; k++) {
            if (target[k] == 0.0f)
                continue;
            float f = (fs * 0.5f) * (float)k / (float)BPF_DESIGN_GRID;
            acc += target[k] * cosf(2.0f * (float)M_PI * f * (float)(n - m) / fs);
        }
        float window = 0.54f - 0.46f * cosf(2.0f * (float)M_PI * (float)n / (float)(taps - 1));
        h[n] = acc / (float)BPF_DESIGN_GRID * window;
    }

    float peak = 0.0f;
    for (int k = 0; k <= BPF_DESIGN_GRID; k++) {
        float f = (fs * 0.5f) * (float)k / (float)BPF_DESIGN_GRID;
        float re = 0.0f, im = 0.0f;
        for (int n = 0; n < taps; n++) {
            float w = 2.0f * (float)M_PI * f * (float)n / fs;
            re += h[n] * cosf(w);
            im -= h[n] * sinf(w);
        }
        float g = sqrtf(re * re + im * im);
        if (g > peak)
            peak = g;
    }
    if (!(peak > 0.0f))
        peak = 1.0f;

