hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/modem.c
    for (int n = 0; n < taps; n++)
        out[n] = (int16_t)lrintf(h[n] / peak * 32767.0f);
}

// @brief Clock-recovery and DCD settings of a 1200 Bd demodulator, reading
//        correlator corr through a slicer of the given space weight.
static void setup1200Demod(struct DemodState *dem, uint8_t corr, float weightDb) {
    dem->corr = corr;
    dem->spaceWeightDb = weightDb;
    dem->spaceWeight = (int32_t)lrintf(powf(10.0f, weightDb / 20.0f) * (float)(1 << SLICER_WEIGHT_BITS));
    dem->pllStep = calibratedPllStep(PLL1200_STEP);
    dem->pllLockedTune = (int32_t)(PLL1200_LOCKED_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));
    dem->pllNotLockedTune = (int32_t)(PLL1200_NOT_LOCKED_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));
    dem->dcdMax = DCD1200_MAXPULSE;
    dem->dcdThres = DCD1200_THRES;
    dem->dcdInc = DCD1200_INC;
    dem->dcdDec = DCD1200_DEC;
    dem->dcdTune = (int32_t)(DCD1200_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));
}

// @brief Give a correlator its post-detection low-pass filters, no prefilter.
static void setupCorrelator(struct Correlator *c, const int16_t *lpf, uint8_t taps, uint8_t gainShift) {
    c->prefilter = PREFILTER_NONE;
    c->markLpf.coeffs = lpf;
    c->markLpf.taps = taps;
    c->markLpf.gainShift = gainShift;
    c->spaceLpf.coeffs = lpf;
    c->spaceLpf.taps = taps;
    c->spaceLpf.gainShift = gainShift;
}

// @brief Attach a prefilter to a correlator and record its tilt.
static void setPrefilter(struct Correlator *c, const int16_t *coeffs, uint8_t taps, uint8_t gainShift) {
    c->prefilter = PREFILTER_BANDPASS;
    c->bpf.coeffs = coeffs;
    c->bpf.taps = taps;
    c->bpf.gainShift = gainShift;

    float gMark = firGain(coeffs, taps, markFreq, (float)MODEM_DEMOD_SAMPLERATE);
    float gSpace = firGain(coeffs, taps, spaceFreq, (float)MODEM_DEMOD_SAMPLERATE);
    c->bpfTiltDb = (gMark > 0.0f && gSpace > 0.0f) ? 20.0f * log10f(gSpace / gMark) : 0.0f;
}

// @brief Design a band-pass prefilter from rxTuning into a correlator.
static void designCorrelatorPrefilter(uint8_t index, int8_t tiltDb) {
    struct Correlator *c = &correlators[index];

    designPrefilter(c->bpfTable, rxTuning.bpf_taps, (float)MODEM_DEMOD_SAMPLERATE, (float)rxTuning.bpf_lo_hz, (float)rxTuning.bpf_hi_hz, markFreq, spaceFreq,
                    (float)tiltDb);
    setPrefilter(c, c->bpfTable, rxTuning.bpf_taps, 15);
    c->bpfDesigned = true;
    c->bpfTiltRequestedDb = tiltDb;
}

// @brief Build the 1200 Bd demodulator set selected by rxTuning.
static void setup1200DemodSet(void) {
    const int8_t *tilts = NULL;

    switch (rxTuning.eq_preset) {
        case MODEM_RX_EQ_LEGACY:
            corrCount = 2;
            break;
        case MODEM_RX_EQ_SINGLE:
            corrCount = 1;
            tilts = ModemConfig.flatAudioIn ? tiltSingleFlat : tiltSingleSpeaker;
            break;
        case MODEM_RX_EQ_DIVERSITY2:
            corrCount = 2;
            tilts = ModemConfig.flatAudioIn ? tiltDiv2Flat : tiltDiv2Speaker;
            break;
        case MODEM_RX_EQ_DIVERSITY3:
            corrCount = 3;
            tilts = ModemConfig.flatAudioIn ? tiltDiv3Flat : tiltDiv3Speaker;
            break;
        case MODEM_RX_EQ_CUSTOM:
            corrCount = rxTuning.custom_count;
            tilts = rxTuning.custom_tilt_db;
            break;
        case MODEM_RX_EQ_MULTISLICE:
        default: {
            const int8_t *tilts = ModemConfig.flatAudioIn ? sliceTiltFlat : sliceTiltSpeaker;
            const float (*targets)[MODEM_RX_SLICE_WEIGHTS] = ModemConfig.flatAudioIn ? sliceTargetFlat : sliceTargetSpeaker;

            corrCount = MODEM_RX_SLICE_PREFILTERS;
            demodCount = MODEM_RX_SLICER_COUNT;
            for (uint8_t c = 0; c < corrCount; c++) {
                setupCorrelator(&correlators[c], lpf1200, sizeof(lpf1200) / sizeof(*lpf1200), 15);
                designCorrelatorPrefilter(c, tilts[c]);
                for (uint8_t k = 0; k < MODEM_RX_SLICE_WEIGHTS; k++) {
                    // The slicer supplies whatever the prefilter's realized
                    // tilt leaves between it and the target.
                    float weightDb = targets[c][k] - correlators[c].bpfTiltDb;
                    weightDb = fmaxf(fminf(weightDb, SLICE_WEIGHT_DB_MAX), -SLICE_WEIGHT_DB_MAX);
                    setup1200Demod(&demodState[(uint8_t)(c * MODEM_RX_SLICE_WEIGHTS + k)], c, weightDb);
                }
            }
            return;
        }
    }

    // Every other set: one slicer, at unit weight, per correlator.
    demodCount = corrCount;
    for (uint8_t i = 0; i < corrCount; i++) {
        setupCorrelator(&correlators[i], lpf1200, sizeof(lpf1200) / sizeof(*lpf1200), 15);
        setup1200Demod(&demodState[i], i, 0.0f);
    }

    if (tilts == NULL) {
        // Legacy set: correlator 0 runs a fixed band-pass matched to the kind
        // of input, correlator 1 sees the input unfiltered.
        if (ModemConfig.flatAudioIn)
            setPrefilter(&correlators[0], bpf1200Level, sizeof(bpf1200Level) / sizeof(*bpf1200Level), 15);
        else
            setPrefilter(&correlators[0], bpf1200Tilted, sizeof(bpf1200Tilted) / sizeof(*bpf1200Tilted), 15);
        return;
    }

    for (uint8_t i = 0; i < corrCount; i++)
        designCorrelatorPrefilter(i, tilts[i]);
}

void ModemInit(void) {
    memset(correlators, 0, sizeof(correlators));
    memset(demodState, 0, sizeof(demodState));
    inputPeak = 0;
    inputValley = 0;

    if (ModemConfig.modem > MODEM_MODEM_G3RUH)
        ModemConfig.modem = MODEM_MODEM_BELL202;

    // Receive clock correction for this profile: the ADC error for every
    // station on the air, plus the DAC error when the receiver hears this
    // node's own G3RUH transmitter (see ModemCalibrateSampleRate()).
    rxRateCorrection = adcRateRatio;
    if ((ModemConfig.modem == MODEM_MODEM_G3RUH) && afskGetFullDuplex())
        rxRateCorrection = adcRateRatio / dacRateRatio;

    if ((ModemConfig.modem == MODEM_MODEM_BELL202) || (ModemConfig.modem == MODEM_MODEM_V23)) {
        N = N1200;
        baudRate = 1200.f;

        if (ModemConfig.modem == MODEM_MODEM_BELL202) { // Bell 202
            markFreq = 1200.f;
            spaceFreq = 2200.f;
        } else { // V.23
            markFreq = 1300.f;
            spaceFreq = 2100.f;
        }

        setup1200DemodSet();
    } else if (ModemConfig.modem == MODEM_MODEM_AFSK300) {
        corrCount = 1;
        demodCount = 1;
        N = N300;
        baudRate = 300.f;
        markFreq = 1600.f;
        spaceFreq = 1800.f;

        demodState[0].pllStep = calibratedPllStep(PLL300_STEP);
        demodState[0].pllLockedTune = (int32_t)(PLL300_LOCKED_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));
        demodState[0].pllNotLockedTune = (int32_t)(PLL300_NOT_LOCKED_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));
        demodState[0].dcdMax = DCD300_MAXPULSE;
        demodState[0].dcdThres = DCD300_THRES;
        demodState[0].dcdInc = DCD300_INC;
        demodState[0].dcdDec = DCD300_DEC;
        demodState[0].dcdTune = (int32_t)(DCD300_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));
        demodState[0].spaceWeight = 1 << SLICER_WEIGHT_BITS;

        setupCorrelator(&correlators[0], lpf300, sizeof(lpf300) / sizeof(*lpf300), 15);
        setPrefilter(&correlators[0], bpf300, sizeof(bpf300) / sizeof(*bpf300), 16);
    } else if (ModemConfig.modem == MODEM_MODEM_G3RUH) {
        corrCount = 1;
        demodCount = 1;
        N = N9600;
        baudRate = 9600.f;

        // G3RUH is baseband NRZ, not AFSK: there are no mark and space tones,
        // so both are reported as 0. The tone-reporting helpers must not
        // claim a mark or space frequency for a profile that emits neither.
        markFreq = 0.f;
        spaceFreq = 0.f;

        demodState[0].pllStep = calibratedPllStep(PLL9600_STEP);
        demodState[0].pllLockedTune = (int32_t)(PLL9600_LOCKED_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));
        demodState[0].pllNotLockedTune = (int32_t)(PLL9600_NOT_LOCKED_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));
        demodState[0].dcdMax = DCD9600_MAXPULSE;
        demodState[0].dcdThres = DCD9600_THRES;
        demodState[0].dcdInc = DCD9600_INC;
        demodState[0].dcdDec = DCD9600_DEC;
        demodState[0].dcdTune = (int32_t)(DCD9600_TUNE * (float)((uint32_t)1 << PLL_TUNE_BITS));
        demodState[0].spaceWeight = 1 << SLICER_WEIGHT_BITS;

        // Receive only. Nothing on the TX path runs it -
        // MODEM_BAUDRATE_TIMER_HANDLER() emits a raw 240/20 square - and it
        // should stay that way: shaping the transmitter with this same filter
        // was measured on the host to roughly double the BER, because the TX+RX
        // cascade closes the eye. If transmit shaping is ever wanted it needs
        // its own, wider filter and its own state (the receiver is using this
        // instance concurrently in full duplex).
        correlators[0].prefilter = PREFILTER_NONE;
        correlators[0].markLpf.coeffs = lpf9600;
        correlators[0].markLpf.taps = sizeof(lpf9600) / sizeof(*lpf9600);
        correlators[0].markLpf.gainShift = 16;
    }

    // Transmit steps. The tones and the AFSK symbol phase are built from the
    // real DAC alarm rate, so what goes on the air is exact; before the DAC
    // timer exists the nominal rate stands in. G3RUH's whole-sample symbol
    // length comes from the nominal rate, which is an exact multiple of its
    // baud rate.
    uint32_t dacRate = afskGetDacSampleRate();
    txRateHz = afskGetDacAlarmRate();
    if (!(txRateHz > 0.0f))
        txRateHz = (float)dacRate;

