hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/modem.c
    markStep = (uint32_t)(((double)markFreq * 4294967296.0) / (double)txRateHz + 0.5);
    spaceStep = (uint32_t)(((double)spaceFreq * 4294967296.0) / (double)txRateHz + 0.5);
    baudPhaseStep = (uint32_t)(((double)baudRate * 4294967296.0) / (double)txRateHz + 0.5);
    baudRateStep = (uint16_t)(dacRate / (uint32_t)baudRate);

    for (uint8_t i = 0; i < N; i++) { // correlator coefficients
        coeffLoI[i] = (int16_t)(4095.f * cosf(2.f * (float)M_PI * (float)i / (float)N * markFreq / baudRate));
        coeffLoQ[i] = (int16_t)(4095.f * sinf(2.f * (float)M_PI * (float)i / (float)N * markFreq / baudRate));
        coeffHiI[i] = (int16_t)(4095.f * cosf(2.f * (float)M_PI * (float)i / (float)N * spaceFreq / baudRate));
        coeffHiQ[i] = (int16_t)(4095.f * sinf(2.f * (float)M_PI * (float)i / (float)N * spaceFreq / baudRate));
    }

    // reset the modulator state
    phaseAcc = 0;
    baudPhase = 0;
    sampleIndex = baudRateStep;
    symbolDue = true;
    currentSymbol = 0;
    scrambledSymbol = 0;
    txLfsr = 0x1FFFF;
    rxLfsr = 0x1FFFF;
    dcd = 0;
}

void ModemLogConfig(void) {
    for (uint8_t c = 0; c < corrCount; c++) {
        const struct Correlator *cr = &correlators[c];
        if (cr->bpfDesigned)
            ESP_LOGI(TAG, "prefilter %u: band-pass %u-%u Hz, %u taps, tilt %+d dB requested, %+.1f dB realized", (unsigned)c, (unsigned)rxTuning.bpf_lo_hz,
                     (unsigned)rxTuning.bpf_hi_hz, (unsigned)cr->bpf.taps, (int)cr->bpfTiltRequestedDb, (double)cr->bpfTiltDb);
    }

    // The per-demodulator lines matter where slicers share a correlator: the
    // effective figure is the twist compensation the demodulator applies.
    if (demodCount > corrCount) {
        for (uint8_t i = 0; i < demodCount; i++) {
            const struct DemodState *d = &demodState[i];
            ESP_LOGI(TAG, "demod %u: prefilter %u, space weight %+.1f dB, effective %+.1f dB", (unsigned)i, (unsigned)d->corr, (double)d->spaceWeightDb,
                     (double)(d->spaceWeightDb + correlators[d->corr].bpfTiltDb));
        }
    }

    float txMark = 0, txSpace = 0;
    ModemGetStepTones(&txMark, &txSpace);
    ESP_LOGI(TAG, "mark %.1f Hz -> emits %.2f, space %.1f Hz -> emits %.2f, DAC %.1f Hz, %u demodulator(s), RX clock correction %+.3f%%", markFreq, txMark,
             spaceFreq, txSpace, (double)txRateHz, (unsigned)demodCount, (double)((rxRateCorrection - 1.0f) * 100.0f));
}
